{
  "paths": {
    "zh-hsk1": {
      "id": "zh-hsk1",
      "type": "linear",
      "name": "HSK1 Beginner",
      "nameTranslations": {
        "pt": "HSK1 Iniciante"
      },
      "description": "Complete HSK1 course with 4 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK1"
      },
      "icon": "graduation",
      "language": "zh",
      "estimatedHours": 8,
      "difficulty": "beginner",
      "milestones": [
        {
          "id": "hsk1-unit-1",
          "level": "HSK1",
          "name": "Getting Started",
          "nameTranslations": {
            "pt": "Primeiros Passos"
          },
          "description": "After completing this unit, students will be able to greet people, introduce themselves with basic personal information, use numbers 0-10, ask and answer simple questions, and engage in basic conversational exchanges using fundamental Chinese sentence patterns.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de cumprimentar pessoas, se apresentar com informações pessoais básicas, usar números de 0 a 10, fazer e responder perguntas simples, e participar de trocas conversacionais básicas usando padrões fundamentais de frases em chinês."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.3,
          "lessons": [
            "hsk1-u1-l1",
            "hsk1-u1-l2",
            "hsk1-u1-l3",
            "hsk1-u1-l4",
            "hsk1-u1-l5"
          ]
        },
        {
          "id": "hsk1-unit-2",
          "level": "HSK1",
          "name": "Family and People",
          "nameTranslations": {
            "pt": "Família e Pessoas"
          },
          "description": "After completing this unit, students will be able to talk about their family members, describe people using basic adjectives, ask and answer questions about quantities, and make simple introductions using possessive structures and measure words.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de falar sobre membros da família, descrever pessoas usando adjetivos básicos, fazer e responder perguntas sobre quantidades, e fazer apresentações simples usando estruturas possessivas e palavras de medida."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 1.7,
          "lessons": [
            "hsk1-u2-l1",
            "hsk1-u2-l2",
            "hsk1-u2-l3",
            "hsk1-u2-l4"
          ]
        },
        {
          "id": "hsk1-unit-3",
          "level": "HSK1",
          "name": "Time and Daily Life",
          "nameTranslations": {
            "pt": "Tempo e Vida Cotidiana"
          },
          "description": "After completing this unit, students will be able to tell time, describe daily activities and their timing, express possession using 有/没有, discuss weekly schedules, and give comprehensive descriptions of their daily routines. They will have integrated time expressions with previously learned vocabulary about family and basic sentence patterns.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de dizer as horas, descrever atividades diárias e seus horários, expressar posse usando 有/没有, discutir cronogramas semanais, e dar descrições abrangentes de suas rotinas diárias. Terão integrado expressões de tempo com vocabulário previamente aprendido sobre família e padrões básicos de frases."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.3,
          "lessons": [
            "hsk1-u3-l1",
            "hsk1-u3-l2",
            "hsk1-u3-l3",
            "hsk1-u3-l4",
            "hsk1-u3-l5"
          ]
        },
        {
          "id": "hsk1-unit-4",
          "level": "HSK1",
          "name": "Food and Places",
          "nameTranslations": {
            "pt": "Comida e Lugares"
          },
          "description": "After completing this unit, students will be able to order food and drinks in restaurants, express their food preferences, describe the location of places in the city, and ask for and give basic directions to common destinations.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de pedir comida e bebidas em restaurantes, expressar suas preferências alimentares, descrever a localização de lugares na cidade, e pedir e dar direções básicas para destinos comuns."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 1.9,
          "lessons": [
            "hsk1-u4-l1",
            "hsk1-u4-l2",
            "hsk1-u4-l3",
            "hsk1-u4-l4"
          ]
        }
      ]
    },
    "zh-hsk2": {
      "id": "zh-hsk2",
      "type": "linear",
      "name": "HSK2 Elementary",
      "nameTranslations": {
        "pt": "HSK2 Elementar"
      },
      "description": "Complete HSK2 course with 5 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK2"
      },
      "icon": "book",
      "language": "zh",
      "estimatedHours": 12,
      "difficulty": "elementary",
      "milestones": [
        {
          "id": "hsk2-unit-1",
          "level": "HSK2",
          "name": "Weather and Seasons",
          "nameTranslations": {
            "pt": "Clima e Estações"
          },
          "description": "After completing this unit, students will be able to describe weather conditions, talk about seasonal activities, share past weather experiences, make weather-related plans, and use key grammar patterns including 了, 过, 比, modal verbs, and causal expressions to communicate effectively about weather and seasons.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de descrever condições climáticas, falar sobre atividades sazonais, compartilhar experiências climáticas passadas, fazer planos relacionados ao clima, e usar padrões gramaticais importantes incluindo 了, 过, 比, verbos modais, e expressões causais para se comunicar efetivamente sobre clima e estações."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.7,
          "lessons": [
            "hsk2-u1-l1",
            "hsk2-u1-l2",
            "hsk2-u1-l3",
            "hsk2-u1-l4",
            "hsk2-u1-l5"
          ]
        },
        {
          "id": "hsk2-unit-2",
          "level": "HSK2",
          "name": "Transportation and Travel",
          "nameTranslations": {
            "pt": "Transporte e Viagem"
          },
          "description": "After completing this unit, students will be able to discuss transportation methods, describe completed travel experiences using 了, ask for and give basic directions, and share travel stories combining all learned patterns and vocabulary.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir métodos de transporte, descrever experiências de viagem concluídas usando 了, pedir e dar direções básicas, e compartilhar histórias de viagem combinando todos os padrões e vocabulário aprendidos."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2,
          "lessons": [
            "hsk2-u2-l1",
            "hsk2-u2-l2",
            "hsk2-u2-l3",
            "hsk2-u2-l4"
          ]
        },
        {
          "id": "hsk2-unit-3",
          "level": "HSK2",
          "name": "Shopping and Money",
          "nameTranslations": {
            "pt": "Compras e Dinheiro"
          },
          "description": "After completing this unit, students will be able to navigate basic shopping situations, compare products, ask about prices, make purchases, and understand simple shopping-related conversations and texts using key grammar patterns including 会 for ability, 比 for comparisons, and 了 for completed actions.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de navegar situações básicas de compras, comparar produtos, perguntar sobre preços, fazer compras, e entender conversas e textos simples relacionados a compras usando padrões gramaticais importantes incluindo 会 para habilidade, 比 para comparações, e 了 para ações completadas."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.7,
          "lessons": [
            "hsk2-u3-l1",
            "hsk2-u3-l2",
            "hsk2-u3-l3",
            "hsk2-u3-l4",
            "hsk2-u3-l5"
          ]
        },
        {
          "id": "hsk2-unit-4",
          "level": "HSK2",
          "name": "Health and Body",
          "nameTranslations": {
            "pt": "Saúde e Corpo"
          },
          "description": "After completing this unit, students will be able to describe body parts, express health problems and symptoms, communicate with medical professionals about their condition, and discuss health habits and recovery using continuous state markers and degree complements.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de descrever partes do corpo, expressar problemas de saúde e sintomas, se comunicar com profissionais médicos sobre sua condição, e discutir hábitos de saúde e recuperação usando marcadores de estado contínuo e complementos de grau."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.2,
          "lessons": [
            "hsk2-u4-l1",
            "hsk2-u4-l2",
            "hsk2-u4-l3",
            "hsk2-u4-l4"
          ]
        },
        {
          "id": "hsk2-unit-5",
          "level": "HSK2",
          "name": "Hobbies and Interests",
          "nameTranslations": {
            "pt": "Hobbies e Interesses"
          },
          "description": "After completing this unit, students will be able to discuss their hobbies and interests in detail, express preferences with reasons, describe frequency of activities, talk about past experiences, and engage in natural conversations about leisure activities using integrated vocabulary and grammar patterns.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir seus hobbies e interesses detalhadamente, expressar preferências com razões, descrever frequência de atividades, falar sobre experiências passadas, e participar de conversas naturais sobre atividades de lazer usando vocabulário e padrões gramaticais integrados."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.7,
          "lessons": [
            "hsk2-u5-l1",
            "hsk2-u5-l2",
            "hsk2-u5-l3",
            "hsk2-u5-l4",
            "hsk2-u5-l5"
          ]
        }
      ]
    },
    "zh-hsk3": {
      "id": "zh-hsk3",
      "type": "linear",
      "name": "HSK3 Intermediate",
      "nameTranslations": {
        "pt": "HSK3 Intermediário"
      },
      "description": "Complete HSK3 course with 5 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK3"
      },
      "icon": "star",
      "language": "zh",
      "estimatedHours": 14,
      "difficulty": "intermediate",
      "milestones": [
        {
          "id": "hsk3-unit-1",
          "level": "HSK3",
          "name": "Work and Career",
          "nameTranslations": {
            "pt": "Trabalho e Carreira"
          },
          "description": "After completing this unit, students will be able to discuss work and career topics confidently, use complex grammatical structures like 把/被 sentences and conditional statements, describe professional experiences and goals, and participate in formal workplace conversations including job interviews.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir tópicos de trabalho e carreira com confiança, usar estruturas gramaticais complexas como frases 把/被 e declarações condicionais, descrever experiências e objetivos profissionais, e participar de conversas formais no ambiente de trabalho incluindo entrevistas de emprego."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.1,
          "lessons": [
            "hsk3-u1-l1",
            "hsk3-u1-l2",
            "hsk3-u1-l3",
            "hsk3-u1-l4",
            "hsk3-u1-l5",
            "hsk3-u1-l6"
          ]
        },
        {
          "id": "hsk3-unit-2",
          "level": "HSK3",
          "name": "Relationships and Social Life",
          "nameTranslations": {
            "pt": "Relacionamentos e Vida Social"
          },
          "description": "After completing this unit, students will be able to describe personal relationships, handle social invitations, discuss conflicts diplomatically, and express complex ideas about social situations using advanced grammar patterns including passive voice, conditional structures, and comparison forms.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de descrever relacionamentos pessoais, lidar com convites sociais, discutir conflitos diplomaticamente e expressar ideias complexas sobre situações sociais usando padrões gramaticais avançados incluindo voz passiva, estruturas condicionais e formas comparativas."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.7,
          "lessons": [
            "hsk3-u2-l1",
            "hsk3-u2-l2",
            "hsk3-u2-l3",
            "hsk3-u2-l4",
            "hsk3-u2-l5"
          ]
        },
        {
          "id": "hsk3-unit-3",
          "level": "HSK3",
          "name": "Environment and Nature",
          "nameTranslations": {
            "pt": "Meio Ambiente e Natureza"
          },
          "description": "After completing this unit, students will be able to describe environmental issues, express opinions about environmental protection using complex grammar structures including 把 sentences, 被 passive voice, comparison patterns, and conditional statements. They can discuss natural environments, environmental changes, pollution problems, and protection measures with confidence.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de descrever questões ambientais, expressar opiniões sobre proteção ambiental usando estruturas gramaticais complexas incluindo sentenças 把, voz passiva 被, padrões comparativos e declarações condicionais. Eles podem discutir ambientes naturais, mudanças ambientais, problemas de poluição e medidas de proteção com confiança."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3,
          "lessons": [
            "hsk3-u3-l1",
            "hsk3-u3-l2",
            "hsk3-u3-l3",
            "hsk3-u3-l4",
            "hsk3-u3-l5",
            "hsk3-u3-l6"
          ]
        },
        {
          "id": "hsk3-unit-4",
          "level": "HSK3",
          "name": "Culture and Traditions",
          "nameTranslations": {
            "pt": "Cultura e Tradições"
          },
          "description": "After completing this unit, students will be able to describe traditional festivals and cultural practices, compare different cultures using advanced grammar structures, express opinions about cultural changes, and discuss cross-cultural understanding using complex sentence patterns including 不但...而且, 把 sentences, 越来越, and comparison structures.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de descrever festivais tradicionais e práticas culturais, comparar diferentes culturas usando estruturas gramaticais avançadas, expressar opiniões sobre mudanças culturais e discutir compreensão intercultural usando padrões de sentenças complexas incluindo 不但...而且, sentenças 把, 越来越 e estruturas comparativas."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.4,
          "lessons": [
            "hsk3-u4-l1",
            "hsk3-u4-l2",
            "hsk3-u4-l3",
            "hsk3-u4-l4",
            "hsk3-u4-l5"
          ]
        },
        {
          "id": "hsk3-unit-5",
          "level": "HSK3",
          "name": "Education and Learning",
          "nameTranslations": {
            "pt": "Educação e Aprendizagem"
          },
          "description": "After completing this unit, students will be able to discuss educational experiences, express opinions about learning methods, describe academic goals and challenges, and understand the broader role of education in society using complex grammatical structures including 把 sentences, result complements, passive voice, and compound sentence patterns.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir experiências educacionais, expressar opiniões sobre métodos de aprendizagem, descrever objetivos acadêmicos e desafios, e compreender o papel mais amplo da educação na sociedade usando estruturas gramaticais complexas incluindo sentenças 把, complementos de resultado, voz passiva e padrões de sentenças compostas."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.6,
          "lessons": [
            "hsk3-u5-l1",
            "hsk3-u5-l2",
            "hsk3-u5-l3",
            "hsk3-u5-l4",
            "hsk3-u5-l5",
            "hsk3-u5-l6"
          ]
        }
      ]
    },
    "zh-hsk4": {
      "id": "zh-hsk4",
      "type": "linear",
      "name": "HSK4 Upper-Intermediate",
      "nameTranslations": {
        "pt": "HSK4 Intermediário Superior"
      },
      "description": "Complete HSK4 course with 6 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK4"
      },
      "icon": "trophy",
      "language": "zh",
      "estimatedHours": 18,
      "difficulty": "intermediate",
      "milestones": [
        {
          "id": "hsk4-unit-1",
          "level": "HSK4",
          "name": "Social Issues and Community",
          "nameTranslations": {
            "pt": "Questões Sociais e Comunidade"
          },
          "description": "After completing this unit, students will be able to discuss social issues and community topics using complex sentence structures, express opinions about environmental and social problems, understand news articles about community affairs, and participate in discussions about civic engagement and community action.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir questões sociais e tópicos comunitários usando estruturas de sentenças complexas, expressar opiniões sobre problemas ambientais e sociais, compreender artigos de notícias sobre assuntos comunitários e participar de discussões sobre engajamento cívico e ação comunitária."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.4,
          "lessons": [
            "hsk4-u1-l1",
            "hsk4-u1-l2",
            "hsk4-u1-l3",
            "hsk4-u1-l4",
            "hsk4-u1-l5",
            "hsk4-u1-l6"
          ]
        },
        {
          "id": "hsk4-unit-2",
          "level": "HSK4",
          "name": "Media and Communication",
          "nameTranslations": {
            "pt": "Mídia e Comunicação"
          },
          "description": "After completing this unit, students will be able to understand various types of media, read and discuss news articles, express opinions about current events, describe communication methods, and critically evaluate information sources using appropriate grammar patterns for reporting and expressing viewpoints.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de compreender vários tipos de mídia, ler e discutir artigos de notícias, expressar opiniões sobre eventos atuais, descrever métodos de comunicação e avaliar criticamente fontes de informação usando padrões gramaticais apropriados para reportar e expressar pontos de vista."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.3,
          "lessons": [
            "hsk4-u2-l1",
            "hsk4-u2-l2",
            "hsk4-u2-l3",
            "hsk4-u2-l4",
            "hsk4-u2-l5"
          ]
        },
        {
          "id": "hsk4-unit-3",
          "level": "HSK4",
          "name": "Technology and Modern Life",
          "nameTranslations": {
            "pt": "Tecnologia e Vida Moderna"
          },
          "description": "After completing this unit, students will be able to discuss various aspects of technology's role in modern life, express nuanced opinions about digital trends, analyze the social impact of technological changes, and participate in conversations about future technological developments using advanced grammatical structures.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir vários aspectos do papel da tecnologia na vida moderna, expressar opiniões matizadas sobre tendências digitais, analisar o impacto social das mudanças tecnológicas e participar de conversas sobre desenvolvimentos tecnológicos futuros usando estruturas gramaticais avançadas."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.9,
          "lessons": [
            "hsk4-u3-l1",
            "hsk4-u3-l2",
            "hsk4-u3-l3",
            "hsk4-u3-l4",
            "hsk4-u3-l5",
            "hsk4-u3-l6"
          ]
        },
        {
          "id": "hsk4-unit-4",
          "level": "HSK4",
          "name": "Business and Economics",
          "nameTranslations": {
            "pt": "Negócios e Economia"
          },
          "description": "After completing this unit, students will be able to discuss various aspects of business and economics, from starting a company to analyzing market trends. They can understand business news, participate in professional discussions about economic topics, and express opinions about market conditions and business strategies using advanced grammar patterns.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir vários aspectos de negócios e economia, desde iniciar uma empresa até analisar tendências de mercado. Eles podem compreender notícias de negócios, participar de discussões profissionais sobre tópicos econômicos e expressar opiniões sobre condições de mercado e estratégias de negócios usando padrões gramaticais avançados."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.5,
          "lessons": [
            "hsk4-u4-l1",
            "hsk4-u4-l2",
            "hsk4-u4-l3",
            "hsk4-u4-l4",
            "hsk4-u4-l5"
          ]
        },
        {
          "id": "hsk4-unit-5",
          "level": "HSK4",
          "name": "Traditional Culture and Arts",
          "nameTranslations": {
            "pt": "Cultura Tradicional e Artes"
          },
          "description": "After completing this unit, students will be able to discuss various aspects of traditional Chinese culture and arts using sophisticated grammar patterns, understand cultural concepts and their modern relevance, and express opinions about cultural preservation and adaptation with appropriate formal language.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir vários aspectos da cultura tradicional chinesa e artes usando padrões gramaticais sofisticados, compreender conceitos culturais e sua relevância moderna, e expressar opiniões sobre preservação e adaptação cultural com linguagem formal apropriada."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.2,
          "lessons": [
            "hsk4-u5-l1",
            "hsk4-u5-l2",
            "hsk4-u5-l3",
            "hsk4-u5-l4",
            "hsk4-u5-l5",
            "hsk4-u5-l6"
          ]
        },
        {
          "id": "hsk4-unit-6",
          "level": "HSK4",
          "name": "Abstract Concepts and Philosophy",
          "nameTranslations": {
            "pt": "Conceitos Abstratos e Filosofia"
          },
          "description": "After completing this unit, students will be able to discuss complex abstract and philosophical concepts in Chinese, understand philosophical texts, express personal views on ethical and moral issues, and engage in sophisticated intellectual discourse using advanced grammar patterns and abstract vocabulary.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de discutir conceitos abstratos e filosóficos complexos em chinês, compreender textos filosóficos, expressar pontos de vista pessoais sobre questões éticas e morais, e engajar em discurso intelectual sofisticado usando padrões gramaticais avançados e vocabulário abstrato."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.3,
          "lessons": [
            "hsk4-u6-l1",
            "hsk4-u6-l2",
            "hsk4-u6-l3",
            "hsk4-u6-l4",
            "hsk4-u6-l5",
            "hsk4-u6-l6"
          ]
        }
      ]
    },
    "zh-hsk5": {
      "id": "zh-hsk5",
      "type": "linear",
      "name": "HSK5 Advanced",
      "nameTranslations": {
        "pt": "HSK5 Avançado"
      },
      "description": "Complete HSK5 course with 6 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK5"
      },
      "icon": "crown",
      "language": "zh",
      "estimatedHours": 18,
      "difficulty": "upper-intermediate",
      "milestones": [
        {
          "id": "hsk5-unit-1",
          "level": "HSK5",
          "name": "Current Affairs and Politics",
          "nameTranslations": {
            "pt": "Atualidades e Política"
          },
          "description": "After completing this unit, students will be able to read Chinese news articles about politics and current affairs, understand formal political discourse, express opinions on governmental policies, and participate in discussions about democratic processes and international relations using appropriate formal register and advanced vocabulary.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de ler artigos de notícias chinesas sobre política e atualidades, compreender o discurso político formal, expressar opiniões sobre políticas governamentais e participar de discussões sobre processos democráticos e relações internacionais usando registro formal apropriado e vocabulário avançado."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.1,
          "lessons": [
            "hsk5-u1-l1",
            "hsk5-u1-l2",
            "hsk5-u1-l3",
            "hsk5-u1-l4",
            "hsk5-u1-l5",
            "hsk5-u1-l6"
          ]
        },
        {
          "id": "hsk5-unit-2",
          "level": "HSK5",
          "name": "Academic Research and Scholarship",
          "nameTranslations": {
            "pt": "Pesquisa Acadêmica e Erudição"
          },
          "description": "After completing this unit, students will be able to read academic papers, understand research methodology, write formal academic documents, analyze data and statistics, construct logical arguments, prepare research proposals, and participate effectively in scholarly communication and conferences.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de ler artigos acadêmicos, compreender metodologia de pesquisa, escrever documentos acadêmicos formais, analisar dados e estatísticas, construir argumentos lógicos, preparar propostas de pesquisa e participar efetivamente da comunicação acadêmica e conferências."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.3,
          "lessons": [
            "hsk5-u2-l1",
            "hsk5-u2-l2",
            "hsk5-u2-l3",
            "hsk5-u2-l4",
            "hsk5-u2-l5",
            "hsk5-u2-l6"
          ]
        },
        {
          "id": "hsk5-unit-3",
          "level": "HSK5",
          "name": "Literature and Literary Analysis",
          "nameTranslations": {
            "pt": "Literatura e Análise Literária"
          },
          "description": "After completing this unit, students will be able to read and analyze Chinese literary works, understand basic literary terminology and devices, write structured literary criticism, and discuss literature within its cultural context using appropriate academic language.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de ler e analisar obras literárias chinesas, compreender terminologia e recursos literários básicos, escrever crítica literária estruturada e discutir literatura dentro de seu contexto cultural usando linguagem acadêmica apropriada."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.2,
          "lessons": [
            "hsk5-u3-l1",
            "hsk5-u3-l2",
            "hsk5-u3-l3",
            "hsk5-u3-l4",
            "hsk5-u3-l5",
            "hsk5-u3-l6"
          ]
        },
        {
          "id": "hsk5-unit-4",
          "level": "HSK5",
          "name": "Professional Communication",
          "nameTranslations": {
            "pt": "Comunicação Profissional"
          },
          "description": "After completing this unit, students will be able to communicate effectively in professional Chinese contexts, write formal business documents, participate confidently in meetings and presentations, and handle complex workplace communication scenarios with appropriate register and cultural sensitivity.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de se comunicar efetivamente em contextos profissionais chineses, escrever documentos comerciais formais, participar com confiança de reuniões e apresentações, e lidar com cenários complexos de comunicação no local de trabalho com registro apropriado e sensibilidade cultural."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.7,
          "lessons": [
            "hsk5-u4-l1",
            "hsk5-u4-l2",
            "hsk5-u4-l3",
            "hsk5-u4-l4",
            "hsk5-u4-l5"
          ]
        },
        {
          "id": "hsk5-unit-5",
          "level": "HSK5",
          "name": "Philosophy and Ethics",
          "nameTranslations": {
            "pt": "Filosofia e Ética"
          },
          "description": "After completing this unit, students will be able to engage in sophisticated discussions about philosophical concepts, analyze ethical dilemmas using appropriate Chinese vocabulary, understand major schools of Chinese philosophy, and critically examine contemporary moral issues in Chinese society. They will have developed advanced reading skills for philosophical texts and writing abilities for analytical essays on abstract topics.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de se envolver em discussões sofisticadas sobre conceitos filosóficos, analisar dilemas éticos usando vocabulário chinês apropriado, compreender as principais escolas da filosofia chinesa e examinar criticamente questões morais contemporâneas na sociedade chinesa. Eles terão desenvolvido habilidades avançadas de leitura para textos filosóficos e capacidades de escrita para ensaios analíticos sobre tópicos abstratos."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.2,
          "lessons": [
            "hsk5-u5-l1",
            "hsk5-u5-l2",
            "hsk5-u5-l3",
            "hsk5-u5-l4",
            "hsk5-u5-l5",
            "hsk5-u5-l6"
          ]
        },
        {
          "id": "hsk5-unit-6",
          "level": "HSK5",
          "name": "Cultural Synthesis and Expression",
          "nameTranslations": {
            "pt": "Síntese e Expressão Cultural"
          },
          "description": "After completing this unit, students will be able to express themselves with native-like fluency across all registers, seamlessly integrate classical and modern Chinese elements, write sophisticated academic and creative texts, and demonstrate complete cultural competence in professional and artistic contexts.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de se expressar com fluência nativa em todos os registros, integrar perfeitamente elementos clássicos e modernos do chinês, escrever textos acadêmicos e criativos sofisticados, e demonstrar competência cultural completa em contextos profissionais e artísticos."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 2.8,
          "lessons": [
            "hsk5-u6-l1",
            "hsk5-u6-l2",
            "hsk5-u6-l3",
            "hsk5-u6-l4",
            "hsk5-u6-l5",
            "hsk5-u6-l6"
          ]
        }
      ]
    },
    "zh-hsk6": {
      "id": "zh-hsk6",
      "type": "linear",
      "name": "HSK6 Mastery",
      "nameTranslations": {
        "pt": "HSK6 Domínio"
      },
      "description": "Complete HSK6 course with 7 units",
      "descriptionTranslations": {
        "pt": "Curso completo de HSK6"
      },
      "icon": "crown",
      "language": "zh",
      "estimatedHours": 29,
      "difficulty": "advanced",
      "milestones": [
        {
          "id": "hsk6-unit-1",
          "level": "HSK6",
          "name": "Mastery of Classical and Modern Integration",
          "nameTranslations": {
            "pt": "Domínio da Integração Clássica e Moderna"
          },
          "description": "After completing this unit, students will be able to read classical Chinese texts with comprehension, understand the historical development of the Chinese language, and skillfully integrate classical references into modern academic and literary writing, demonstrating true mastery of both traditional and contemporary Chinese expression.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de ler textos chineses clássicos com compreensão, entender o desenvolvimento histórico da língua chinesa e integrar habilmente referências clássicas na escrita acadêmica e literária moderna, demonstrando verdadeiro domínio da expressão chinesa tradicional e contemporânea."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 5.3,
          "lessons": [
            "hsk6-u1-l1",
            "hsk6-u1-l2",
            "hsk6-u1-l3",
            "hsk6-u1-l4",
            "hsk6-u1-l5",
            "hsk6-u1-l6"
          ]
        },
        {
          "id": "hsk6-unit-2",
          "level": "HSK6",
          "name": "Specialized Academic Discourse",
          "nameTranslations": {
            "pt": "Discurso Acadêmico Especializado"
          },
          "description": "After completing this unit, students will be able to engage confidently in specialized academic discourse across multiple disciplines, demonstrate mastery of sophisticated argumentation techniques, interpret complex research data with precision, conduct critical literature reviews, deliver professional academic presentations, and produce publication-quality writing that meets the highest standards of academic excellence.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de se envolver com confiança no discurso acadêmico especializado em múltiplas disciplinas, demonstrar domínio de técnicas sofisticadas de argumentação, interpretar dados de pesquisa complexos com precisão, conduzir revisões críticas de literatura, fazer apresentações acadêmicas profissionais e produzir escrita de qualidade de publicação que atenda aos mais altos padrões de excelência acadêmica."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.1,
          "lessons": [
            "hsk6-u2-l1",
            "hsk6-u2-l2",
            "hsk6-u2-l3",
            "hsk6-u2-l4",
            "hsk6-u2-l5",
            "hsk6-u2-l6"
          ]
        },
        {
          "id": "hsk6-unit-3",
          "level": "HSK6",
          "name": "Advanced Media and Critical Analysis",
          "nameTranslations": {
            "pt": "Mídia Avançada e Análise Crítica"
          },
          "description": "After completing this unit, students will be able to critically analyze complex media texts, evaluate source credibility, synthesize information from multiple perspectives, and produce sophisticated analytical writing demonstrating advanced media literacy skills essential for academic and professional contexts.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de analisar criticamente textos de mídia complexos, avaliar credibilidade de fontes, sintetizar informações de múltiplas perspectivas e produzir escrita analítica sofisticada demonstrando habilidades avançadas de alfabetização midiática essenciais para contextos acadêmicos e profissionais."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.4,
          "lessons": [
            "hsk6-u3-l1",
            "hsk6-u3-l2",
            "hsk6-u3-l3",
            "hsk6-u3-l4",
            "hsk6-u3-l5",
            "hsk6-u3-l6"
          ]
        },
        {
          "id": "hsk6-unit-4",
          "level": "HSK6",
          "name": "Cultural and Literary Mastery",
          "nameTranslations": {
            "pt": "Domínio Cultural e Literário"
          },
          "description": "After completing this unit, students will be able to analyze classical Chinese literature, understand regional cultural variations, engage in sophisticated cultural discourse, and demonstrate near-native proficiency in discussing Chinese cultural and literary topics with appropriate linguistic sophistication.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de analisar literatura chinesa clássica, compreender variações culturais regionais, se envolver em discurso cultural sofisticado e demonstrar proficiência quase nativa ao discutir tópicos culturais e literários chineses com sofisticação linguística apropriada."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 4.8,
          "lessons": [
            "hsk6-u4-l1",
            "hsk6-u4-l2",
            "hsk6-u4-l3",
            "hsk6-u4-l4",
            "hsk6-u4-l5",
            "hsk6-u4-l6"
          ]
        },
        {
          "id": "hsk6-unit-5",
          "level": "HSK6",
          "name": "Professional Excellence and Leadership",
          "nameTranslations": {
            "pt": "Excelência Profissional e Liderança"
          },
          "description": "After completing this unit, students will be able to lead complex professional discussions, navigate sophisticated business negotiations, communicate strategic vision across organizational levels, and demonstrate executive presence in formal Chinese business contexts with near-native cultural fluency.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de liderar discussões profissionais complexas, navegar negociações empresariais sofisticadas, comunicar visão estratégica em todos os níveis organizacionais e demonstrar presença executiva em contextos empresariais chineses formais com fluência cultural quase nativa."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 3.1,
          "lessons": [
            "hsk6-u5-l1",
            "hsk6-u5-l2",
            "hsk6-u5-l3",
            "hsk6-u5-l4",
            "hsk6-u5-l5",
            "hsk6-u5-l6"
          ]
        },
        {
          "id": "hsk6-unit-6",
          "level": "HSK6",
          "name": "Philosophical and Intellectual Mastery",
          "nameTranslations": {
            "pt": "Domínio Filosófico e Intelectual"
          },
          "description": "After completing this unit, students will be able to engage in the highest levels of philosophical discourse in Chinese, demonstrating mastery of classical and modern philosophical vocabulary, complex argumentation structures, and the ability to analyze, synthesize, and debate abstract concepts with native-level sophistication across all major areas of philosophical inquiry.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes serão capazes de participar dos mais altos níveis de discurso filosófico em chinês, demonstrando domínio do vocabulário filosófico clássico e moderno, estruturas argumentativas complexas e a capacidade de analisar, sintetizar e debater conceitos abstratos com sofisticação de nível nativo em todas as principais áreas de investigação filosófica."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 4.3,
          "lessons": [
            "hsk6-u6-l1",
            "hsk6-u6-l2",
            "hsk6-u6-l3",
            "hsk6-u6-l4",
            "hsk6-u6-l5",
            "hsk6-u6-l6"
          ]
        },
        {
          "id": "hsk6-unit-7",
          "level": "HSK6",
          "name": "Comprehensive Mastery Integration",
          "nameTranslations": {
            "pt": "Integração de Domínio Abrangente"
          },
          "description": "After completing this unit, students will have achieved comprehensive mastery of Chinese language, demonstrating native-like fluency across all skills, cultural sophistication, and the ability to communicate effectively in any professional, academic, or social context with appropriate style and register.",
          "descriptionTranslations": {
            "pt": "Após completar esta unidade, os estudantes terão alcançado domínio abrangente da língua chinesa, demonstrando fluência semelhante à de um falante nativo em todas as habilidades, sofisticação cultural e a capacidade de comunicar-se efetivamente em qualquer contexto profissional, acadêmico ou social com estilo e registro apropriados."
          },
          "module": "lessons",
          "requirement": {
            "type": "complete-all"
          },
          "estimatedHours": 4.6,
          "lessons": [
            "hsk6-u7-l1",
            "hsk6-u7-l2",
            "hsk6-u7-l3",
            "hsk6-u7-l4",
            "hsk6-u7-l5",
            "hsk6-u7-l6"
          ]
        }
      ]
    }
  },
  "pathOrder": [
    "zh-hsk1",
    "zh-hsk2",
    "zh-hsk3",
    "zh-hsk4",
    "zh-hsk5",
    "zh-hsk6"
  ]
}